EmbeddedSystemClass/Truck_Project1/PIC24_support/esos1/Truck_App.h
#if 1
//    All rights reserved.
//
//    Permission to use, copy, modify, and distribute this software and its
//    documentation for any purpose, without fee, and without written agreement is
//    hereby granted, provided that the above copyright notice, the following
//    two paragraphs and the authors appear in all copies of this software.
//
//    IN NO EVENT SHALL THE "AUTHORS" BE LIABLE TO ANY PARTY FOR
//    DIRECT, INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES ARISING OUT
//    OF THE USE OF THIS SOFTWARE AND ITS DOCUMENTATION, EVEN IF THE "AUTHORS"
//    HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//
//    THE "AUTHORS" SPECIFICALLY DISCLAIMS ANY WARRANTIES,
//    INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY
//    AND FITNESS FOR A PARTICULAR PURPOSE.  THE SOFTWARE PROVIDED HEREUNDER IS
//    ON AN "AS IS" BASIS, AND THE "AUTHORS" HAS NO OBLIGATION TO
//    PROVIDE MAINTENANCE, SUPPORT, UPDATES, ENHANCEMENTS, OR MODIFICATIONS."
//
//    Please maintain this header in its entirety when copying/modifying
//    these files.
//
//
// "I am not so much concerned with the return on capital as I am with the return of capital." - Will Rogers
//
#define DEBUG
#include "../esos/include/esos.h"
#include "../esos/include/pic24/esos_pic24.h"
#include "../esos/include/pic24/esos_pic24_rs232.h"
#include "../esos/include/pic24/esos_pic24_spi.h"
#include "../lib/include/pic24_all.h"
#include "../lib/include/pic24_timer.h"
#include "../lib/include/pic24_util.h"
#include "../lib/include/pic24_adc.h"
#include "../lib/include/pic24_ports_config.h"
#include "../lib/include/pic24_ports_mapping.h"
#include "pic_t6963.h"
//#include "main.h"
//#include "../../AVR_t6963/key_defs.h"
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
// DEFINEs go here
//#define   CONFIG_LED1()   printf("called CONFIG_LED1()\n");
uint8_t     LED1 = TRUE;      // LED1 is initially "on"
#ifdef DEBUG
#define DEBUG_CHAR_AT 1
#define DEBUG_STRING_AT 2
#define DEBUG_SET_CURSOR 3
#define DEBUG_CLRSCR1 4
#define DEBUG_CLRSCR2 5
#define DEBUG_CLRSCR3 6
#define DEBUG_MSG1 7
#endif
#define MY_ESOS1
#define TIME_DELAY		20
#define TEMP_DELAY3		2
#define TEMP_DELAY2		1000
#define TDELAY 2
#define TDELAY2 1
#define VREF 3.3  //assume Vref = 3.3 volts
#define FLAG1        ESOS_USER_FLAG_1
#define RT_OFFSET 0x70
//#define AUX_STRING_LEN 1024	// this should be the same as AUX_STRING_LEN in AVR_t6963/main.h
#define AUX_STRING_LEN 300

#define NO_MENU_LABELS_EEPROM_LOCATION 0x03e0
#define NO_RT_LABELS_EEPROM_LOCATION 0x03e4
#define NO_RTPARAMS_EEPROM_LOCATION 0x03e8
#define NO_MENUS_EEPROM_LOCATION 0x3ea
#define RT_PARAMS_OFFSET_EEPROM_LOCATION 0x0350
#define MAX_LABEL_LEN 10
#define RT_OFFSET 0x70
#define NUM_ENTRY_SIZE 7
//#define NUM_ENTRY_BEGIN_COL (COLUMN - COLUMN/2)
#define NUM_ENTRY_BEGIN_COL 3
#define NUM_ENTRY_END_COL NUM_ENTRY_BEGIN_COL + NUM_ENTRY_SIZE
#define NUM_ENTRY_ROW 8
#define NUM_CHECKBOXES 10
#define TEMP_EEPROM_OFFSET 400
#define NUM_CBLABELS 50
#define CBLABEL_SIZE 600
#define TIME_DELAY1 1
#define NUM_FPTS 6
#define NUM_LABELS 40
#define NUM_MENU_CHOICES 6
#define NUM_RT_PARAMS 11
#define NUM_RT_LABELS NUM_RT_PARAMS

#define DISP_OFFSET 1
#define LAST_ROW DISP_OFFSET + 58
#define NUM_EXECCHOICES 10
#define SCALE_DISP_ALL 0
#define SCALE_DISP_SOME 1
#define SCALE_DISP_NONE 2
#define RT_OFFSET 0x70
#define SIM_EEPROM_SIZE 0x800
#define CBLABEL_SIZE 600

char cblabels[CBLABEL_SIZE];

#endif

#if 1
volatile int avr_ptr;
volatile UCHAR random_data;
volatile int checkbox_offsets[NUM_CBLABELS];

int get_label(int index, char *str);
UCHAR get_keypress(UCHAR key1);
volatile int goffset;

int pack(UCHAR low_byte, UCHAR high_byte);
void unpack(int myint, UCHAR *low_byte, UCHAR *high_byte);
int update_menu_structs(int i, UCHAR fptr, UCHAR menu0, UCHAR menu1, UCHAR menu2, UCHAR menu3,
			UCHAR menu4, UCHAR menu5, UCHAR index);
UCHAR menu_change(UCHAR ch);
UCHAR do_exec(UCHAR ch);
UCHAR do_chkbox(UCHAR ch);
UCHAR non_func(UCHAR ch);
UCHAR do_numentry(UCHAR ch);
UCHAR do_init(UCHAR ch);

int prev_list(void);
volatile int current_fptr;		// pointer into the menu_list[]
volatile int prev_fptr;
volatile int list_size;
volatile int dirty_flag;
int curr_checkbox;
int curr_execchoice;
int last_checkbox;
volatile int first_menu;
volatile char cur_global_number[NUM_ENTRY_SIZE];
volatile char new_global_number[NUM_ENTRY_SIZE];
volatile int sample_numbers[5];
volatile int _size;
volatile int debug_stringat_len;
volatile int debug_message_len;
volatile int start_addr;
volatile UCHAR cur_col;
volatile UCHAR cur_row;
volatile int sync;
UCHAR curr_menus[6];
UCHAR enter(UCHAR ch);
void init_numentry(int menu_index);
void cursor_forward_stuff(char x);
void stuff_num(char num);
void cursor_forward(char ch);
static void init_checkboxes(int index);
static void blank_choices(void);
static void blank_display(void);
static void blank_menu(void);
#define LIST_SIZE 50
static int curr_chkbox_index;
volatile int menu_list[LIST_SIZE];	// works like a stack for the how deep into the menus we go
UCHAR set_list(int fptr);
UCHAR get_fptr(void);
void get_fptr_label(char *str);
int get_curr_menu_index(void);
int get_curr_menu(void);
UCHAR backspace(UCHAR ch);
void _eclear(void);
void cursor_backward(void);
static int scrollup_checkboxes(int index);
static int scrolldown_checkboxes(int index);
static int scrollup_execchoice(int index);
static int scrolldown_execchoice(int index);
static int toggle_checkboxes(int index);
static void clean_disp_num(void);
static void display_edit_value(void);
static void display_menus(void);
void adv_menu_label(int index, UCHAR *row, UCHAR *col);
static void init_execchoices(int menu_index);
static UCHAR checkboxes_reset(int index);
#define NUM_ENTRY_SIZE 7
//#define NUM_ENTRY_BEGIN_COL (COLUMN - COLUMN/2)
#define NUM_ENTRY_BEGIN_COL 3
#define NUM_ENTRY_END_COL NUM_ENTRY_BEGIN_COL + NUM_ENTRY_SIZE
// '!' - '9' (33 - 58) + 'A' - 'Z' (26) + 'a' - 'z' (26) = 77
//#define NUM_ALNUM 77
//#define NUM_ALNUM 52		// without the '!' - '9'
#define NUM_ALNUM 85		// include all special chars
#define ALNUM_SCROLL_LIST_LEN 13
#define MENU_START_ROW 14
#define MENU_START_COL 3
#define MENU_BLANK "          "
#ifdef DEBUG
#define _dispCharAt(_row,_col,_char) PIC_DispCharAt((UINT)_row+15,(UINT)_col+15,(UCHAR)_char)
#define _dispStringAt(_row,_col,_char) PIC_DispStringAt((UINT)_row+15,(UINT)_col+15,(char *)_char)
#define _dispSetCursor(_mode,_row,_col,_type) PIC_SetCursor ((UCHAR)_mode, (UINT)_row, (UINT)_col, (UCHAR)_type)
#define _dispSetMode(_mode) PIC_GDispSetMode(_mode)
#define _dispClrTxt1() PIC_DispClrTxt1()
#define _dispClrTxt2() PIC_DispClrTxt2()
#define _dispClrTxt3() PIC_DispClrTxt3()
#define _dispDebugMessage(_row,_col,_char) PIC_DispDebugMessage((UINT)_row,(UINT)_col,(char *)_char)
#else
#define _dispCharAt(_row,_col,_char) GDispCharAt((UINT)_row,(UINT)_col,(UCHAR)_char)
#define _dispStringAt(_row,_col,_char) GDispStringAt((UINT)_row,(UINT)_col,(char *)_char)
#define _dispSetCursor(_mode,_row,_col,_type) GDispSetCursor ((UCHAR)_mode, (UINT)_row, (UINT)_col, (UCHAR)_type)
#define _dispSetMode(_mode) GDispSetMode(_mode)
#endif
//#else
//#endif
void dispRC(int row, int col);
void CheckRC(int *row, int *col, UCHAR *k);
void display_labels(void);
int curr_fptr_changed(void);
int get_curr_menu(void);
int get_str_len(void);
int update_mlabels(int i, char *str);
int update_cblabels(int i, char *str);
void get_cblabel(int index, char *str);
UCHAR get_row(int index);
UCHAR get_col(int index);
int get_mlabel_offsets(void);
int get_cblabel_offsets(void);
void get_mlabel(int index, char *str);
void init_list(void);
int mlabel_offsets[NUM_LABELS+NUM_RT_LABELS];
int cblabel_offsets[NUM_CBLABELS];

#define NO_MENU_LABELS_EEPROM_LOCATION 0x03e0
#define NO_RT_LABELS_EEPROM_LOCATION 0x03e4
#define NO_RTPARAMS_EEPROM_LOCATION 0x03e8
#define NO_MENUS_EEPROM_LOCATION 0x3ea
#define RT_PARAMS_OFFSET_EEPROM_LOCATION 0x0350
#if 0
#define RTPARAMS_OFFSET_EEPROM_LOCATION_LSB 0x03e8	// points to just after all the labels (prompt_info)
#define RTPARAMS_OFFSET_EEPROM_LOCATION_MSB 0x03ea
#define MENUSTRUCT_OFFSET_EEPROM_LOCATION_LSB 0x03ec	// points to just after all the labels (prompt_info)
#define MENUSTRUCT_OFFSET_EEPROM_LOCATION_MSB 0x03ee
#endif

int rt_params_offset;
int no_cblabels;
int global_fd;
void set_state_defaults(void);
int curr_execchoice;
int last_execchoice;
int scale_type;
int prev_scale_type;

typedef struct checkboxes
{
	UCHAR index;
	UCHAR checked;
} CHECKBOXES;

CHECKBOXES check_boxes[NUM_CBLABELS];
CHECKBOXES prev_check_boxes[NUM_CBLABELS];

enum data_types
{
	RT_LOW,				// uint8_t without high bit set
	RT_HIGH0,			// uint8_t with bit 7 set
	RT_HIGH1,			// UINT with neither 7 or 15 set
	RT_HIGH2,			// bit 7 of UINT set
	RT_HIGH3			// bit 15 of UINT set
} DATA_TYPES;

// warning: these are also defined in the AVR directory
// got mult defined errors if enums have the same names
// but got undefined errors if left out ???

