EmbeddedSystemClass/Truck_Project1/PIC24_support/esos1/Truck_App.h
	switch (index % 6)
	{
		case 0: strncpy(temp2," A:\0",4);break;
		case 1: strncpy(temp2," B:\0",4);break;
		case 2: strncpy(temp2," C:\0",4);break;
		case 3: strncpy(temp2," D:\0",4);break;
		case 4: strncpy(temp2," #:\0",4);break;
		case 5: strncpy(temp2," 0:\0",4);break;
		default:strncpy(temp2,"\0",4);break;
	}

	get_mlabel(curr_menus[index],temp);
//	strcpy(temp,"asdf\0");

	if(temp[0] != 0)
	{
		_dispStringAt(*row,*col,temp2);
		_dispStringAt(*row,*col+3,temp);
	}

	// if MAX_LABEL_LEN > 10 then menus will be too wide
	if(*col > MAX_LABEL_LEN*2-1)
	{
		*col = 0;
		(*row)++;
	}
	else
		*col += MAX_LABEL_LEN;
}
//******************************************************************************************//
//************************************* display_menus **************************************//
//******************************************************************************************//
static void display_menus(void)
{
	UCHAR row,col;
	row = MENU_START_ROW;
	col = MENU_START_COL;
	col = 0;
	blank_menu();
	adv_menu_label(0,&row,&col);
	adv_menu_label(1,&row,&col);
	adv_menu_label(2,&row,&col);
	adv_menu_label(3,&row,&col);
	adv_menu_label(4,&row,&col);
	adv_menu_label(5,&row,&col);
}

//******************************************************************************************//
//******************************************************************************************//
//******************************************************************************************//
UCHAR menu_change(UCHAR ch)
{
	UCHAR ret_char = ch;
	int menu_index = 0;
	int curr_menu;

	curr_menu = get_curr_menu();
//	strcpy((char *)state,"menu_change       \0");
	switch(ch)
	{
		case KP_A:
		break;
		case KP_B:
		menu_index++;
		break;
		case KP_C:
		menu_index += 2;
		break;
		case KP_D:
		menu_index += 3;
		break;
		case KP_POUND:
		menu_index += 4;
		break;
		case KP_0:
		menu_index += 5;
		break;
		case KP_AST:
		prev_list();
		break;
		default:
		break;
	}
	if(ch != KP_AST)
		ret_char = set_list(menu_structs[curr_menu].menus[menu_index]);

	return ret_char;
}
//******************************************************************************************//
//******************************************************************************************//
//******************************************************************************************//
UCHAR do_init(UCHAR ch)
{
	init_list();
	return ch;
}
//******************************************************************************************//
//******************************************************************************************//
//******************************************************************************************//
void init_list(void)
{
//	int i = 0;
//	UCHAR k;
#if 0
	alnum_array[i++] = 33;		// first one is a '!'
	for(k = 34;k < 48;k++)		// '"' - '/'	14
		alnum_array[i++] = k;
	alnum_array[i++] = 32;		// 'space'		1
	for(k = 58;k < 65;k++)		// ':' - '@'	7
		alnum_array[i++] = k;
	for(k = 91;k < 97;k++)		// '[' - '`'	6
		alnum_array[i++] = k;
	for(k = 123;k < 127;k++)	// '{' - '~'	4
		alnum_array[i++] = k;
	for(k = 65;k < 91;k++)		// 'A' - 'Z'	26
		alnum_array[i++] = k;
	for(k = 97;k < 123;k++)		// 'a' - 'z'	26	total: 85 (NUM_ALNUM)
		alnum_array[i++] = k;
	choose_alnum = 0x30;
	scroll_ptr = 25;		// start showing at 'a' (skip '!' - '9')
	cur_alnum_col = NUM_ENTRY_BEGIN_COL;
#endif
	list_size = LIST_SIZE;
	current_fptr = first_menu;
	prev_fptr = first_menu;
	memset((void *)menu_list,0,sizeof(menu_list));
	menu_list[0] = current_fptr;
	dirty_flag = 0;
	curr_checkbox = 0;
	last_checkbox = NUM_CHECKBOXES-1;
//	last_execchoice = NUM_EXECCHOICES-1;
//	scale_type = 0;
//	prev_scale_type = 1;
	cur_row = NUM_ENTRY_ROW;
	cur_col = NUM_ENTRY_BEGIN_COL;
	display_menus();
}
//******************************************************************************************//
//******************************************************************************************//
//******************************************************************************************//
int prev_list(void)
{
	int ret;

	if(current_fptr == 0)
		ret = -1;
	else
	{
		menu_list[current_fptr] = 0;
		current_fptr--;
		dirty_flag = 1;
		ret = 0;
	}
	return ret;
}
//******************************************************************************************//
//******************************************************************************************//
//******************************************************************************************//
UCHAR set_list(int fptr)
{
	int k;
	UCHAR ret_char = 0;
//	char tlabel[MAX_LABEL_LEN];

	if(current_fptr < list_size)
	{
		current_fptr++;
		menu_list[current_fptr] = fptr;

		ret_char = get_curr_menu_index();
		if(menu_structs[get_curr_menu()].fptr != _menu_change)
		{
			k = get_curr_menu_index();
			switch(ret_char)
			{
				case MENU1C:	// 1st do_chkbox
				case MENU1D:	// 2nd do_chkbox
					init_checkboxes(k);
				break;
				case MENU1E:
				case MENU2A:
				case MENU2B:
					init_checkboxes(k);
				break;
				case MENU2C:	// do_numentry
				case MENU2D:
				case MENU2E:
				case MENU3A:
				case MENU3B:
					init_numentry(ret_char);
				break;
				default:
				break;
			}
		}
	}
	return ret_char;
}
//******************************************************************************************//
//******************************************************************************************//
//******************************************************************************************//
UCHAR do_numentry(UCHAR ch)
{
	UCHAR ret_char = ch;

	
//	strcpy((char *)state,"do_numentry     \0");

	switch(ch)
	{
		case KP_0:
		cursor_forward_stuff(0);
		break;
		case KP_1:
		cursor_forward_stuff(1);
		break;
		case KP_2:
		cursor_forward_stuff(2);
		break;
		case KP_3:
		cursor_forward_stuff(3);
		break;
		case KP_4:
		cursor_forward_stuff(4);
		break;
		case KP_5:
		cursor_forward_stuff(5);
		break;
		case KP_6:
		cursor_forward_stuff(6);
		break;
		case KP_7:
		cursor_forward_stuff(7);
		break;
		case KP_8:
		cursor_forward_stuff(8);
		break;
		case KP_9:
		cursor_forward_stuff(9);
		break;
		case KP_A:
		cursor_forward(ch);
		break;
		case KP_B:
		backspace(ch);
		break;
		case KP_C:
		_eclear();
		break;
		case KP_D:
		enter(ch);
		prev_list();
		break;
		case KP_POUND:
		prev_list();
		break;
		case KP_AST:
			prev_list();
		break;
		default:
		break;
	}
	return ret_char;
}
//******************************************************************************************//
//************************************ clean_disp_num **************************************//
//******************************************************************************************//
static void clean_disp_num(void)
{
	int i;
	for(i = 0;i < NUM_ENTRY_SIZE+1;i++)
	{
		_dispCharAt(NUM_ENTRY_ROW,i+NUM_ENTRY_BEGIN_COL,0x20);
//		dispCharAt(NUM_ENTRY_ROW,i+NUM_ENTRY_BEGIN_COL+1,0x20);
	}
}
//******************************************************************************************//
//******************************************* escape ***************************************//
//******************************************************************************************//
UCHAR escape(UCHAR ch)
{
	memset((void*)cur_global_number,0,NUM_ENTRY_SIZE);
	cur_col = NUM_ENTRY_BEGIN_COL;
	clean_disp_num();
	return ch;
}
//******************************************************************************************//
//******************************************* enter ****************************************//
//******************************************************************************************//
UCHAR enter(UCHAR ch)
{
	int limit;
	int index;
	if(1)
//	if(data_entry_mode)
	{
		limit = atoi((const char *)cur_global_number);
		if(limit > 32767)
			strcpy((char *)cur_global_number,"32766\0");
		memcpy((void*)new_global_number,(void*)cur_global_number,NUM_ENTRY_SIZE);
		cur_col = NUM_ENTRY_BEGIN_COL;

		index = get_curr_menu_index() - MENU2C;
		sample_numbers[index] = atoi((const char *)new_global_number);
	}
	memset((void*)new_global_number,0,NUM_ENTRY_SIZE);
	memset((void*)cur_global_number,0,NUM_ENTRY_SIZE);
	return ch;
}
//******************************************************************************************//
//********************************* display_edit_value *************************************//
//******************************************************************************************//
static void display_edit_value(void)
{
	_dispStringAt(NUM_ENTRY_ROW,NUM_ENTRY_BEGIN_COL,(char *)cur_global_number);
	cur_col = strlen((const char *)cur_global_number)+NUM_ENTRY_BEGIN_COL;
//	dispCharAt(NUM_ENTRY_ROW,cur_col,'x');
    _dispSetCursor(TEXT_ON | CURSOR_BLINK_ON,NUM_ENTRY_ROW,cur_col,LINE_8_CURSOR);
	_dispCharAt(NUM_ENTRY_ROW+1,cur_col,95);
}
//******************************************************************************************//
//*************************************** init_numentry ************************************//
//******************************************************************************************//
void init_numentry(int menu_index)
{
	int temp_int;
	cur_row = NUM_ENTRY_ROW;
	cur_col = NUM_ENTRY_BEGIN_COL;
//	memset((void*)new_global_number,0,NUM_ENTRY_SIZE);
	memset((void*)cur_global_number,0,NUM_ENTRY_SIZE);

	temp_int = sample_numbers[menu_index-MENU2C];
	sprintf((char *)cur_global_number,"%4d",temp_int);
	aux_string[AUX_STRING_LEN-1] = (UCHAR)temp_int;
	temp_int >>= 8;
	aux_string[AUX_STRING_LEN-2] = (UCHAR)temp_int;
	cur_col = strlen((const char *)cur_global_number)+NUM_ENTRY_BEGIN_COL;
}
//******************************************************************************************//
//********************************** cursor_forward_stuff **********************************//
//******************************************************************************************//
void cursor_forward_stuff(char x)
{
//	if(data_entry_mode)
	if(1)
	{
		stuff_num(x);
		cursor_forward(x);
	}
}
//******************************************************************************************//
//*************************************** stuff_num ****************************************//
//******************************************************************************************//
void stuff_num(char num)
{
	num += 0x30;
	cur_global_number[cur_col-NUM_ENTRY_BEGIN_COL] = num;
}
//******************************************************************************************//
//************************************* cursor_forward *************************************//
//******************************************************************************************//
void cursor_forward(char ch)
{
	if(++cur_col > NUM_ENTRY_END_COL)
		cur_col = NUM_ENTRY_BEGIN_COL;
}
//******************************************************************************************//
//***************************************** backspace **************************************//
//******************************************************************************************//
UCHAR backspace(UCHAR ch)
{
//	if(data_entry_mode)
	if(1)
	{
		cursor_backward();
		cur_global_number[cur_col-NUM_ENTRY_BEGIN_COL] = 0x20;
	}
	return ch;
}
//******************************************************************************************//
//**************************************** _eclear *******************************************//
//******************************************************************************************//
void _eclear(void)
{
	cur_row = NUM_ENTRY_ROW;
	cur_col = NUM_ENTRY_BEGIN_COL;
	memset((void*)new_global_number,0,NUM_ENTRY_SIZE);
	memset((void*)cur_global_number,0,NUM_ENTRY_SIZE);
}
//******************************************************************************************//
//************************************* cursor_backward ************************************//
//******************************************************************************************//
void cursor_backward(void)
{
	if(--cur_col < NUM_ENTRY_BEGIN_COL)
		cur_col = NUM_ENTRY_BEGIN_COL;
}
//******************************************************************************************//
//******************************************************************************************//
//******************************************************************************************//
UCHAR do_exec(UCHAR ch)
{
	UCHAR ret_char = ch;
	int j,k;

	k = get_curr_menu_index() * NUM_CHECKBOXES;

	switch(ch)
	{
		case KP_A:
			j = scrollup_execchoice(k);
		break;
		case KP_B:
			j = scrolldown_execchoice(k);
		break;
		case KP_C:
		break;
		case KP_D:
			prev_list();
		break;
		case KP_POUND:
		break;
		case KP_0:
		break;
		case KP_AST:
			prev_list();
			blank_choices();
		break;
		default:
		break;
	}

	return ret_char;
}

//******************************************************************************************//
//******************************************************************************************//
//******************************************************************************************//
UCHAR do_chkbox(UCHAR ch)
{
	UCHAR ret_char = ch;
	int i, j, k;
	k = get_curr_menu_index() * NUM_CHECKBOXES;

	switch(ch)
	{
		case KP_A:
			j = scrollup_checkboxes(k);
		break;
		case KP_B:
			j = scrolldown_checkboxes(k);
		break;
		case KP_C:
			j = toggle_checkboxes(k);
		break;
		case KP_D:		// enter
			for(i = 0;i < NUM_CHECKBOXES;i++)
				check_boxes[i].checked = prev_check_boxes[i].checked;
			prev_list();
		break;
		case KP_POUND:		// esc
			for(i = 0;i < NUM_CHECKBOXES;i++)
				prev_check_boxes[i].checked = check_boxes[i].checked;
			prev_list();
		break;
		case KP_0:
			j = checkboxes_reset(k);
		break;
		case KP_AST:
			prev_list();
		break;
		default:
		break;
	}

	return ret_char;
}
//******************************************************************************************//
//************************************* init_checkboxes ************************************//
//******************************************************************************************//
static void init_checkboxes(int index )
{
	int i,j;
	UCHAR row, col;
	char tlabel[MAX_LABEL_LEN];
//	scale_disp(SCALE_DISP_SOME);
	row = 0;
	col = 3;
	curr_checkbox = 0;

	blank_display();

	j = curr_chkbox_index * NUM_CHECKBOXES;


	for(i = 0;i < NUM_CHECKBOXES;i++)
	{
		get_cblabel(j+i,tlabel);
		_dispStringAt(row,col,tlabel);

		if(check_boxes[j+i].checked > 0)
		{
			_dispCharAt(row,0,0x78);
			check_boxes[j+i].checked = 1;
		}
		else
		{
			_dispCharAt(row,0,0x5F);	// underscore
			check_boxes[j+i].checked = 0;
		}
		row++;
	}
}
//******************************************************************************************//
//*********************************** init_execchoices *************************************//
//******************************************************************************************//
static void init_execchoices(int menu_index)
{
	int i,j;
	UCHAR row, col;
	char tlabel[MAX_LABEL_LEN];
//	scale_disp(SCALE_DISP_SOME);
	row = 0;
	col = 3;
	curr_checkbox = 0;

	blank_display();

	j = curr_chkbox_index * NUM_CHECKBOXES;

	for(i = 0;i < NUM_CHECKBOXES;i++)
	{
		get_cblabel(j+i,tlabel);
		_dispStringAt(row,col,tlabel);
		row++;
	}
}
//******************************************************************************************//
//*********************************** checkboxes_reset *************************************//
//******************************************************************************************//
static UCHAR checkboxes_reset(int index)
{
//	int k = index+curr_checkbox;
	int i,k;
	curr_checkbox = 0;
	k = curr_chkbox_index * NUM_CHECKBOXES;

	for(i = 0;i < NUM_CHECKBOXES;i++)
	{
		check_boxes[k+i].checked = 0;
		curr_checkbox++;
		k++;
		_dispCharAt(1+curr_checkbox,20,0x5F);
	}
	curr_checkbox = 0;
	return k;
}
//******************************************************************************************//
//********************************** scrollup_checkboxes ***********************************//
//******************************************************************************************//
static int scrollup_checkboxes(int index)
{
	int k;
	char tlabel[MAX_LABEL_LEN];
	char blank[] = "             ";

//	dispCharAt(curr_checkbox,20,0x5F);
	k = (curr_chkbox_index * NUM_CHECKBOXES)+curr_checkbox;
	get_cblabel(k,tlabel);
	_dispSetMode(ATTR_REVERSE);
	_dispStringAt(curr_checkbox,3,blank);
	_dispStringAt(curr_checkbox,3,tlabel);
	_dispSetMode(ATTR_REVERSE);

	if(--curr_checkbox < 0)
		curr_checkbox = 9;
	// move cursor to 3 + check_boxes[curr_checkbox]
	k = (curr_chkbox_index * NUM_CHECKBOXES)+curr_checkbox;

	get_cblabel(k,tlabel);
	_dispSetMode(ATTR_REVERSE);
	_dispStringAt(curr_checkbox,3,blank);
	_dispStringAt(curr_checkbox,4,tlabel);
	_dispSetMode(ATTR_REVERSE);

//	dispCharAt(1+check_boxes[k].index,20,0x21);
	return k;
}
//******************************************************************************************//
//********************************* scrolldown_checkboxes **********************************//
//******************************************************************************************//
static int scrolldown_checkboxes(int index)
{
	int k;
	char tlabel[MAX_LABEL_LEN];
	char blank[] = "             ";

