EmbeddedSystemClass/Truck_Project1/PIC24_support/esos1/Truck_App.h
//	dispCharAt(1+curr_checkbox,20,0x20);

	k = (curr_chkbox_index * NUM_CHECKBOXES)+curr_checkbox;
	get_cblabel(k,tlabel);
	_dispSetMode(ATTR_REVERSE);
	_dispStringAt(curr_checkbox,3,blank);
	_dispStringAt(curr_checkbox,3,tlabel);
	_dispSetMode(ATTR_REVERSE);

	if(++curr_checkbox > 9)
		curr_checkbox = 0;

	k = (curr_chkbox_index * NUM_CHECKBOXES)+curr_checkbox;
	get_cblabel(k,tlabel);
	_dispSetMode(ATTR_REVERSE);
	_dispStringAt(curr_checkbox,3,blank);
	_dispStringAt(curr_checkbox,4,tlabel);
	_dispSetMode(ATTR_REVERSE);

	return k;
}
//******************************************************************************************//
//********************************** toggle_checkboxes *************************************//
//******************************************************************************************//
static int toggle_checkboxes(int index)
{
	int k = (curr_chkbox_index * NUM_CHECKBOXES)+curr_checkbox;
	_dispCharAt(1+curr_checkbox,20,0x20);

	if(check_boxes[k].checked == 1)
	{
		check_boxes[k].checked = 0;
		_dispCharAt(curr_checkbox,0,0x5f);	// display '_'
	}
	else
	{
		check_boxes[k].checked = 1;
		_dispCharAt(curr_checkbox,0,120);	// display 'x'
	}
	return k;
}
//******************************************************************************************//
//********************************** scrollup_execchoice ***********************************//
//******************************************************************************************//
static int scrollup_execchoice(int ch)
{
	int k;
	char tlabel[MAX_LABEL_LEN];
	char blank[] = "             ";

//	dispCharAt(curr_checkbox,20,0x5F);
	k = (curr_chkbox_index * NUM_CHECKBOXES)+curr_checkbox;
	get_cblabel(k,tlabel);
//	_dispSetMode(ATTR_REVERSE);
	_dispStringAt(curr_checkbox,3,blank);
	_dispStringAt(curr_checkbox,3,tlabel);
//	_dispSetMode(ATTR_REVERSE);

	if(--curr_checkbox < 0)
		curr_checkbox = 9;
	// move cursor to 3 + check_boxes[curr_checkbox]
	k = (curr_chkbox_index * NUM_CHECKBOXES)+curr_checkbox;

	get_cblabel(k,tlabel);
//	_dispSetMode(ATTR_REVERSE);
	_dispStringAt(curr_checkbox,3,blank);
	_dispStringAt(curr_checkbox,4,tlabel);
//	_dispSetMode(ATTR_REVERSE);

//	dispCharAt(1+check_boxes[k].index,20,0x21);
	return k;

/*
	UCHAR temp = curr_execchoice;
	if(--curr_execchoice < 0)
		curr_execchoice = last_execchoice;

//	mvwprintw(win, DISP_OFFSET+22,2,"%d %d   ",temp,curr_execchoice);
//	wrefresh(win);

	dispCharAt(1+check_boxes[temp].index,0,0x20);
	dispCharAt(1+check_boxes[curr_execchoice].index,0,120);
	return ch;
*/
}
//******************************************************************************************//
//********************************* scrolldown_execchoice **********************************//
//******************************************************************************************//
static int scrolldown_execchoice(int ch)
{
	int k;
	char tlabel[MAX_LABEL_LEN];
	char blank[] = "             ";

//	dispCharAt(1+curr_checkbox,20,0x20);

	k = (curr_chkbox_index * NUM_CHECKBOXES)+curr_checkbox;
	get_cblabel(k,tlabel);
//	_dispSetMode(ATTR_REVERSE);
	_dispStringAt(curr_checkbox,3,blank);
	_dispStringAt(curr_checkbox,3,tlabel);
//	_dispSetMode(ATTR_REVERSE);

	if(++curr_checkbox > 9)
		curr_checkbox = 0;

	k = (curr_chkbox_index * NUM_CHECKBOXES)+curr_checkbox;
	get_cblabel(k,tlabel);
//	_dispSetMode(ATTR_REVERSE);
	_dispStringAt(curr_checkbox,3,blank);
	_dispStringAt(curr_checkbox,4,tlabel);
//	_dispSetMode(ATTR_REVERSE);

	return k;
}
//******************************************************************************************//
//******************************************************************************************//
//******************************************************************************************//
UCHAR non_func(UCHAR ch)
{
	UCHAR ret_char = ch;
	switch(ch)
	{
		case KP_A:
		ret_char = NF_1;
		break;
		case KP_B:
		ret_char = NF_2;
		break;
		case KP_C:
		ret_char = NF_3;
		break;
		case KP_D:
		ret_char = NF_4;
		break;
		case KP_POUND:
		ret_char = NF_5;
		break;
		case KP_0:
		ret_char = NF_6;
		break;
		case KP_AST:
		prev_list();
		break;
		default:
		break;
	}
	return ret_char;
}
//******************************************************************************************//
//******************************************************************************************//
//******************************************************************************************//
UCHAR get_fptr(void)
{
	return menu_structs[get_curr_menu()].fptr;
}
//******************************************************************************************//
//******************************************************************************************//
//******************************************************************************************//
void get_fptr_label(char *str)
{
//	char tlabel[MAX_LABEL_LEN];
//	return menu_labels[menu_structs[get_curr_menu()].fptr+total_no_menu_labels];
//	get_label(menu_structs[get_curr_menu()].fptr+total_no_menu_labels,tlabel);
}
//******************************************************************************************//
//******************************************************************************************//
//******************************************************************************************//
int get_curr_menu(void)
{
	return menu_list[current_fptr];
}
//******************************************************************************************//
//******************************************************************************************//
//******************************************************************************************//
int get_curr_menu_index(void)
{
	return menu_structs[get_curr_menu()].index;
}
//******************************************************************************************//
//******************************************************************************************//
//******************************************************************************************//
int curr_fptr_changed(void)
{
	return 0;
}
//******************************************************************************************//
//******************************************************************************************//
//******************************************************************************************//
static void blank_choices(void)
{
	int row,col,i;
	row = 0;
	col = 0;
	char blank[] = "                        ";
	for(i = 0;i < NUM_CHECKBOXES;i++)
	{
		_dispStringAt(row,col,blank);
		row++;
	}
}
//******************************************************************************************//
//******************************************************************************************//
//******************************************************************************************//
static void blank_display(void)
{
	static UINT row;
	
	for(row = 0;row < 13;row++)
		_dispStringAt(row,0,"                         ");
}
//******************************************************************************************//
//******************************************************************************************//
//******************************************************************************************//
static void blank_menu(void)
{
	static UINT test1a, test1b;
	static UCHAR data1 = 0x21;
	
