EmbeddedSystemClass/Truck_Project1/PIC24_support/esos1/Truck_App.h
#if 0
			ESOS_TASK_WAIT_ON_AVAILABLE_OUT_COMM();
			ESOS_TASK_WAIT_ON_SEND_UINT8('\n');
			ESOS_TASK_WAIT_ON_SEND_UINT8('\r');

			for(i = TEMP_EEPROM_OFFSET; i < AUX_STRING_LEN;i++)
			{
				if(aux_string[i] > 0x1f && aux_string[i] < 0x7e)
					ESOS_TASK_WAIT_ON_SEND_UINT8(aux_string[i]);
				else if(aux_string[i] == 0)
					ESOS_TASK_WAIT_ON_SEND_UINT8(0x20);
				else if( aux_string[i] == 0xff)
					ESOS_TASK_WAIT_ON_SEND_UINT8('_');
				else
					ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING(aux_string[i]);
			}
			ESOS_TASK_WAIT_ON_SEND_UINT8('\n');
			ESOS_TASK_WAIT_ON_SEND_UINT8('\r');
			ESOS_TASK_SIGNAL_AVAILABLE_OUT_COMM();
#endif
		}
		else if(wkey == TEST3)
		{
			low_byte = TEST3;
/* 			ESOS_TASK_WAIT_ON_AVAILABLE_OUT_COMM();
			ESOS_TASK_WAIT_ON_SEND_UINT8('\n');
			ESOS_TASK_WAIT_ON_SEND_UINT8('\r');
		    ESOS_TASK_WAIT_ON_SEND_STRING("test three... ");
			ESOS_TASK_WAIT_ON_SEND_UINT8('\n');
			ESOS_TASK_WAIT_ON_SEND_UINT8('\r');
			ESOS_TASK_SIGNAL_AVAILABLE_OUT_COMM();
 */

#if 0
			ESOS_TASK_WAIT_ON_AVAILABLE_OUT_COMM();
			ESOS_TASK_WAIT_ON_SEND_UINT8('\n');
			ESOS_TASK_WAIT_ON_SEND_UINT8('\r');
			for(i = 0;i < 400;i++)
			{
				if(aux_string[i] > 0x1f && aux_string[i] < 0x7e)
					ESOS_TASK_WAIT_ON_SEND_UINT8(aux_string[i]);
				else if(aux_string[i] == 0)
					ESOS_TASK_WAIT_ON_SEND_UINT8(0x20);
				else if( aux_string[i] == 0xff)
					ESOS_TASK_WAIT_ON_SEND_UINT8('_');
				else
					ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING(aux_string[i]);
			}
			ESOS_TASK_WAIT_ON_SEND_UINT8('\n');
			ESOS_TASK_WAIT_ON_SEND_UINT8('\r');
			ESOS_TASK_SIGNAL_AVAILABLE_OUT_COMM();
#endif
		}
		else if(wkey == TEST4)
		{
			low_byte = TEST4;
//			__esos_CB_WriteUINT8(send_comm_handle->pst_Mailbox->pst_CBuffer,low_byte);
		}
		else if(wkey == TEST5)
		{
			low_byte = TEST5;
//			__esos_CB_WriteUINT8(send_comm_handle->pst_Mailbox->pst_CBuffer,low_byte);

			for(i = 0;i < AUX_STRING_LEN;i++)
				aux_string[i] = ~i - random_data;
			random_data++;

/* 			for(i = 0;i < AUX_STRING_LEN;i++)
			{
				__esos_CB_WriteUINT8(send_comm_handle->pst_Mailbox->pst_CBuffer,aux_string[i]);
			}
 */		}
		else if(wkey == TEST6)
		{
			low_byte = TEST6;
//			__esos_CB_WriteUINT8(send_comm_handle->pst_Mailbox->pst_CBuffer,low_byte);
		}

		else if(wkey == TEST7)
		{
			low_byte = TEST7;
//			__esos_CB_WriteUINT8(send_comm_handle->pst_Mailbox->pst_CBuffer,low_byte);
		}
		else if(wkey == TEST8)
		{
		}
		else if(wkey == TEST9)
		{
		}
		else if(wkey == TEST10)
		{
/* 			ESOS_TASK_WAIT_ON_AVAILABLE_OUT_COMM();
		    ESOS_TASK_WAIT_ON_SEND_STRING("read aux_string from target");
			ESOS_TASK_SIGNAL_AVAILABLE_OUT_COMM();
 */		}
		else if(wkey == TEST11)
		{
//			__esos_CB_WriteUINT8(send_comm_handle->pst_Mailbox->pst_CBuffer,wkey);
		}
		else if(wkey == TEST12)
		{
//			__esos_CB_WriteUINT8(send_comm_handle->pst_Mailbox->pst_CBuffer,wkey);
		}
		else if(wkey == TEST13)
		{
//			__esos_CB_WriteUINT8(send_comm_handle->pst_Mailbox->pst_CBuffer,wkey);
		}
		else if(wkey == TEST14)
		{
//			__esos_CB_WriteUINT8(send_comm_handle->pst_Mailbox->pst_CBuffer,wkey);
		}
		else if(wkey == TEST15)
		{
//			__esos_CB_WriteUINT8(send_comm_handle->pst_Mailbox->pst_CBuffer,wkey);
		}
		else if(wkey == TEST16)
		{
//			__esos_CB_WriteUINT8(send_comm_handle->pst_Mailbox->pst_CBuffer,wkey);
		}
		else if(wkey == TEST17)
		{
//			__esos_CB_WriteUINT8(send_comm_handle->pst_Mailbox->pst_CBuffer,wkey);
		}

		else if(wkey == LOAD_RAM)
		{
#if 0
			for(i = 0;i < CBLABEL_SIZE;i++)
			{
				__esos_CB_WriteUINT8(send_comm_handle->pst_Mailbox->pst_CBuffer,cblabels[i]);
			}
			for(i = 0;i < NUM_CBLABELS;i++)
			{
				__esos_CB_WriteUINT8(send_comm_handle->pst_Mailbox->pst_CBuffer,check_boxes[i].checked);
				__esos_CB_WriteUINT8(send_comm_handle->pst_Mailbox->pst_CBuffer,check_boxes[i].index);
				memcpy(&prev_check_boxes[i],&check_boxes[i],sizeof(CHECKBOXES));
			}
			for(i = 0;i < NUM_RT_PARAMS;i++)
			{
				__esos_CB_WriteUINT8(send_comm_handle->pst_Mailbox->pst_CBuffer,rt_params[i].row);
				__esos_CB_WriteUINT8(send_comm_handle->pst_Mailbox->pst_CBuffer,rt_params[i].col);
				__esos_CB_WriteUINT8(send_comm_handle->pst_Mailbox->pst_CBuffer,rt_params[i].shown);
				__esos_CB_WriteUINT8(send_comm_handle->pst_Mailbox->pst_CBuffer,rt_params[i].dtype);
				__esos_CB_WriteUINT8(send_comm_handle->pst_Mailbox->pst_CBuffer,rt_params[i].type);
			}
			for(i = 0;i < 5;i++)
			{
				j = sample_numbers[i];
				unpack(j,&low_byte,&high_byte);				
				__esos_CB_WriteUINT8(send_comm_handle->pst_Mailbox->pst_CBuffer,low_byte);
				__esos_CB_WriteUINT8(send_comm_handle->pst_Mailbox->pst_CBuffer,high_byte);
			}
#endif
		}
		if(wkey == BURN_PART)
		{
#if 0
			if(_size == -1)
			{
				_size = 234;
				start_addr = 0;
			}

			low_byte = BURN_PART;

			__esos_CB_WriteUINT8(send_comm_handle->pst_Mailbox->pst_CBuffer,low_byte);

			unpack(_size,&low_byte,&high_byte);
			__esos_CB_WriteUINT8(send_comm_handle->pst_Mailbox->pst_CBuffer,high_byte);
			__esos_CB_WriteUINT8(send_comm_handle->pst_Mailbox->pst_CBuffer,low_byte);

			unpack(start_addr,&low_byte,&high_byte);
			__esos_CB_WriteUINT8(send_comm_handle->pst_Mailbox->pst_CBuffer,high_byte);
			__esos_CB_WriteUINT8(send_comm_handle->pst_Mailbox->pst_CBuffer,low_byte);

			ESOS_TASK_WAIT_ON_AVAILABLE_OUT_COMM();
			ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING((UCHAR)(_size>>8));
			ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING((UCHAR)_size);
			ESOS_TASK_SIGNAL_AVAILABLE_OUT_COMM();
			for(i = 0;i < _size;i++)
			{
				__esos_CB_WriteUINT8(send_comm_handle->pst_Mailbox->pst_CBuffer,aux_string[i]);
				ESOS_TASK_WAIT_TICKS(20);
			}
			ESOS_TASK_WAIT_ON_AVAILABLE_OUT_COMM();
			ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING((UCHAR)i);
			ESOS_TASK_SIGNAL_AVAILABLE_OUT_COMM();
#endif
		}

		else if(wkey == READ_EEPROM1)
		{
#if 0
			avr_ptr = 0;
//			ESOS_KILL_TASK(get_comm_handle);
/*
			ESOS_TASK_WAIT_ON_AVAILABLE_OUT_COMM();
			ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING((UCHAR)(_size>>8));
			ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING((UCHAR)_size);
			ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING((UCHAR)(start_addr>>8));
			ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING((UCHAR)start_addr);
			ESOS_TASK_SIGNAL_AVAILABLE_OUT_COMM();
*/
			low_byte = READ_EEPROM;
			__esos_CB_WriteUINT8(send_comm_handle->pst_Mailbox->pst_CBuffer,low_byte);

			unpack(_size,&low_byte,&high_byte);
			__esos_CB_WriteUINT8(send_comm_handle->pst_Mailbox->pst_CBuffer,high_byte);
			__esos_CB_WriteUINT8(send_comm_handle->pst_Mailbox->pst_CBuffer,low_byte);

