EmbeddedSystemClass/Truck_Project1/PIC24_support/esos1/Truck_App.h
//	ch = pch = eeprom_sim;

	size = AUX_STRING_LEN;
	eeprom_read_block((void*)&aux_string[0],(const void *)eepromString,(size_t)size);
	ch = pch = aux_string;
	j = k = 0;
	for(i = 0;i < AUX_STRING_LEN;i++)
	{
		tch = aux_string[i];
		if(tch == 0)
			_dispCharAt(j,k,'_');
		else
			_dispCharAt(j,k,tch);
		if(k++ > COLUMN-1)
		{
			k = 0;
			j++;
		}
	}

	no_menu_labels = 0;
	no_rt_labels = 0;
	rt_params_offset = 0;
	i = 0;


	pch--;
// the eeprom image must have an extra '0' at the end of
// the menu labels and another extra '0' at the end
// of the rt labels
	do
	{
		if(*ch == 0)
			no_menu_labels++;
		i++;
		ch++;
		pch++;
	}while(*ch != 0 || *pch != 0);

	no_menu_labels++;

	if(i > EEPROM_SIZE-10)
		return -1;

	i = 0;
	do
	{
		if(*ch == 0)
			no_rt_labels++;
		i++;
		ch++;
		pch++;
	}while(*ch != 0 || *pch != 0);

	if(i > EEPROM_SIZE-10)
		return -1;

	for(i = 0;i < no_menu_labels+no_rt_labels;i++)
	{
		mlabel_offsets[i] = goffset;
		j = 0;

		memcpy(temp_label,eeprom_sim+goffset,MAX_LABEL_LEN);
#if 0
		eeprom_read_block(temp_label, eepromString+goffset, MAX_LABEL_LEN);
#endif
		ch = &temp_label[0];
		while(*ch != 0 && j < MAX_LABEL_LEN)
		{
			ch++;
			j++;
		}
		j++;			// adjust for zero at end
		goffset += j;
	}
	rt_params_offset = goffset;
	return no_menu_labels;
#endif
	return 0;
}
//******************************************************************************************//
//*************************************** get_label ****************************************//
//******************************************************************************************//
void get_mlabel(int index, char *str)
{

		// void *dest, const void *src, size_t n

//	memcpy(str,eeprom_sim+mlabel_offsets[index],MAX_LABEL_LEN);
#if 0
	eeprom_read_block((void *)str,eepromString+mlabel_offsets[index],MAX_LABEL_LEN);
#endif
}
//******************************************************************************************//
//********************************** get_cblabel_offsets ***********************************//
//******************************************************************************************//
int get_cblabel_offsets(void)
{
	int i, j;
	char *ch;
	char temp_label[MAX_LABEL_LEN];

	goffset = 0;

	no_cblabels = 0;
	for(i = 0;i < CBLABEL_SIZE;i++)
	{
		if(cblabels[i] == 0 && cblabels[i-1] != 0)
			no_cblabels++;
	}

	for(i = 0;i < no_cblabels;i++)
	{
		cblabel_offsets[i] = goffset;
		j = 0;
		memcpy(temp_label,cblabels+goffset,MAX_LABEL_LEN);
		ch = temp_label;
		while(*ch != 0 && j < MAX_LABEL_LEN)
		{
			ch++;
			j++;
		}
		j++;			// adjust for zero at end
		goffset += j;
	}
	return no_cblabels;
}
//******************************************************************************************//
//************************************* get_cblabel ****************************************//
//******************************************************************************************//
void get_cblabel(int index, char *str)
{
		// void *dest, const void *src, size_t n
	memcpy(str,cblabels+cblabel_offsets[index],MAX_LABEL_LEN);
}
//******************************************************************************************//
//************************************* update_cbabels *************************************//
//******************************************************************************************//
int update_cblabels(int index, char *str)
{
	int len;
	len = strlen(str);
	len = (len > MAX_LABEL_LEN?MAX_LABEL_LEN:len);
	len++;
	memcpy(cblabels+total_offset,str, len);
//	strncpy(menu_labels[index],ramstr,len);
	total_offset += len;
	index++;
	return index;
}
// 			_dispCharAt(0x46, 0x47, 0x48);
#endif
#ifdef DEBUG
//******************************************************************************************//
//************************************* PIC_DispCharAt *************************************//
//******************************************************************************************//
void PIC_DispCharAt(UINT row, UINT col, UCHAR c)
{
    static ESOS_TASK_HANDLE handle;
	static ULONG send1;
	static ULONG send2;
	static UCHAR temp;
	
	handle = esos_GetTaskHandle(send_comm1);
	temp = DEBUG_CHAR_AT;
	send1 = (UINT)temp;
	send2 = (UINT)row;
	send2 <<= 8;
	send1 |= send2;
	send2 = (UINT)col;
	send2 <<= 16;
	send1 |= send2;
	send2 = (UINT)c;
	send2 <<= 24;
	send1 |= send2;
/* 	memcpy(buff+1,&row,sizeof(UINT));
	memcpy(buff+3,&col,sizeof(UINT));
	memcpy(buff+5,&c,sizeof(UCHAR));
	buff[6] = 0xff;
	size_buff = 7;
 */
	__esos_CB_WriteUINT32(handle->pst_Mailbox->pst_CBuffer,send1);
}
// 			_dispStringAt(0x30, 0x31,"test string\0");
//******************************************************************************************//
//*********************************** PIC_DispStringAt *************************************//
//******************************************************************************************//
void PIC_DispStringAt(UINT row, UINT col, char *c)
{
    static ESOS_TASK_HANDLE handle;
	static UCHAR buff[100];
	static UINT size_buff;
	static int string_len;
	static int i;
	
	string_len = strlen(c);
//	memset((void *)buff,0,sizeof(buff));
	
	handle = esos_GetTaskHandle(send_stringat);
	buff[0] = DEBUG_STRING_AT;
	memcpy(buff+1,&row,sizeof(UINT));
	memcpy(buff+3,&col,sizeof(UINT));
	memcpy(buff+5,&string_len,sizeof(UINT));
	memcpy(buff+7,c,strlen(c));
//	size_buff = (UINT)string_len + 5;
	buff[8+string_len] = 0xff;
	size_buff = 9+string_len;
	debug_stringat_len = size_buff;
	
	__esos_CB_WriteUINT8Buffer(handle->pst_Mailbox->pst_CBuffer,buff,size_buff);
}
//******************************************************************************************//
//************************************** PIC_SetCursor *************************************//
//******************************************************************************************//
void PIC_SetCursor(UCHAR mode, UINT row, UINT col, UCHAR type)
{
    static ESOS_TASK_HANDLE handle;
	static UCHAR buff[10];
	static UINT size_buff;
	static int i;
	
//	memset((void *)buff,0,sizeof(buff));
	
	handle = esos_GetTaskHandle(send_comm1);
	buff[0] = DEBUG_SET_CURSOR;
	memcpy(buff+1,&mode,sizeof(UCHAR));
	memcpy(buff+2,&row,sizeof(UINT));
	memcpy(buff+4,&col,sizeof(UINT));
	memcpy(buff+6,&type,sizeof(UCHAR));
	size_buff = 8;
	buff[7] = 0xff;

