EmbeddedSystemClass/Truck_Project1/PIC24_support/esos1/Truck_App.h
	__esos_CB_WriteUINT8Buffer(handle->pst_Mailbox->pst_CBuffer,buff,size_buff);
}
//******************************************************************************************//
//************************************ PIC_DispClrTxt1 *************************************//
//******************************************************************************************//
void PIC_DispClrTxt1(void)
{
    static ESOS_TASK_HANDLE handle;
	static UCHAR buff[5];
	static UINT size_buff;
	static int i;
	static UCHAR test;
	
//	memset((void *)buff,0,sizeof(buff));
	
	handle = esos_GetTaskHandle(send_clrtxt1);
	buff[0] = DEBUG_CLRSCR1;
	size_buff = 2;
	buff[1] = 0xff;

	__esos_CB_WriteUINT8(handle->pst_Mailbox->pst_CBuffer,test);
}
//******************************************************************************************//
//************************************ PIC_DispClrTxt2 *************************************//
//******************************************************************************************//
void PIC_DispClrTxt2(void)
{
    static ESOS_TASK_HANDLE handle;
	static UCHAR buff[5];
	static UINT size_buff;
	static int i;
	static UCHAR test;
	
//	memset((void *)buff,0,sizeof(buff));
	
	handle = esos_GetTaskHandle(send_clrtxt2);
	buff[0] = DEBUG_CLRSCR2;
	size_buff = 2;
	buff[1] = 0xff;

	__esos_CB_WriteUINT8(handle->pst_Mailbox->pst_CBuffer,test);
}
//******************************************************************************************//
//************************************ PIC_DispClrTxt3 *************************************//
//******************************************************************************************//
void PIC_DispClrTxt3(void)
{
    static ESOS_TASK_HANDLE handle;
	static UCHAR buff[5];
	static UINT size_buff;
	static int i;
	static UCHAR test;
	
//	memset((void *)buff,0,sizeof(buff));
	
	handle = esos_GetTaskHandle(send_clrtxt3);
	buff[0] = DEBUG_CLRSCR3;
	size_buff = 2;
	buff[1] = 0xff;

	__esos_CB_WriteUINT8(handle->pst_Mailbox->pst_CBuffer,test);
}
//******************************************************************************************//
//*********************************** PIC_GDispSetMode *************************************//
//******************************************************************************************//
void PIC_GDispSetMode(_mode)
{}
//******************************************************************************************//
//********************************** PIC_DispDebugMessage **********************************//
//******************************************************************************************//
// a.k.a. _dispDebugMessage
void PIC_DispDebugMessage(UINT row, UINT col, char *c)
{
    static ESOS_TASK_HANDLE handle;
	static UCHAR buff[100];
	static UINT size_buff;
	static int string_len;
	static int i;
	
	string_len = strlen(c);
//	memset((void *)buff,0,sizeof(buff));
	
	handle = esos_GetTaskHandle(send_debugmsg);
	buff[0] = DEBUG_MSG1;
	memcpy(buff+1,&row,sizeof(UINT));
	memcpy(buff+3,&col,sizeof(UINT));
	memcpy(buff+5,&string_len,sizeof(UINT));
	memcpy(buff+7,c,strlen(c));
//	size_buff = (UINT)string_len + 5;
	buff[8+string_len] = 0xff;
	size_buff = 9+string_len;
	debug_message_len = size_buff;
	
	__esos_CB_WriteUINT8Buffer(handle->pst_Mailbox->pst_CBuffer,buff,size_buff);
}
#endif
